ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/ECAP0_CTL_STS.xml
<module name="ECAP0_CTL_STS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CTL_STS_TSCNT" acronym="CTL_STS_TSCNT" offset="0x0" width="32" description="">
		<bitfield id="TSCNT" width="32" begin="31" end="0" resetval="0x0" description="Active 32 bit Counter register which is used as the Capture time-base" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_CNTPHS" acronym="CTL_STS_CNTPHS" offset="0x4" width="32" description="">
		<bitfield id="CNTPHS" width="32" begin="31" end="0" resetval="0x0" description="Counter Phase value register that can be programmed for phase Lag/Lead. This register shadows TSCNT and is loaded into TSCNT upon either a SYNCI event or S/W force via a control bit.  Used to achieve Phase control sync with respect to other ECAP and EPWM time-bases." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_CAP1" acronym="CTL_STS_CAP1" offset="0x8" width="32" description="">
		<bitfield id="CAP1" width="32" begin="31" end="0" resetval="0x0" description="This register can be loaded (written) by : 1. Time-Stamp (i.e. counter value) during a Capture event 2. S/W - may be useful for test purposes / initialisation 3. APRD shadow register (i.e. CAP3) when used in APWM mode" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_CAP2" acronym="CTL_STS_CAP2" offset="0xC" width="32" description="">
		<bitfield id="CAP2" width="32" begin="31" end="0" resetval="0x0" description="This register can be loaded (written) by : 1. Time-Stamp (i.e. counter value) during a Capture event 2. S/W - may be useful for test purposes 3. ACMP shadow register (i.e. CAP4) when used in APWM mode" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_CAP3" acronym="CTL_STS_CAP3" offset="0x10" width="32" description="">
		<bitfield id="CAP3" width="32" begin="31" end="0" resetval="0x0" description="In CMP mode this is a time-stamp capture register In APMW mode this is the Period Shadow (APER) register. User updates the PWM Period value via this register. In this mode CAP3 (APRD) shadows CAP1" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_CAP4" acronym="CTL_STS_CAP4" offset="0x14" width="32" description="">
		<bitfield id="CAP4" width="32" begin="31" end="0" resetval="0x0" description="In CMP mode this is a time-stamp capture register In APMW mode this is the Compare Shadow (ACMP) register.  User updates the PWM Compare value via this register. In this mode CAP4 (ACMP) shadows CAP2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_ECCTL" acronym="CTL_STS_ECCTL" offset="0x28" width="32" description="">
		<bitfield id="FILTER" width="5" begin="31" end="27" resetval="0x0" description="" range="31 - 27" rwaccess="R"/> 
		<bitfield id="APWMPOL" width="1" begin="26" end="26" resetval="0x0" description="APWM output polarity select: 1'b0 Output is Active High (i.e. Compare value defines High time); 1'b1 Output is Active Low (i.e. Compare value defines Low time); Note: This is applicable only in APWM operating mode" range="26" rwaccess="R/W"/> 
		<bitfield id="CAP_APWM" width="1" begin="25" end="25" resetval="0x0" description="CAP/APWM operating mode select: 1'b0 ECAP module operates in Capture mode This mode forces the following configuration: 1- Inhibits TSCNT resets via PRD_eq event 2- Inhibits Shadow loads on CAP1 &#38; 2 registers 3- Permits User to enable CAP1-4 register load 4- CAPx/APWMx pin operates as a Capture input* 1'b1 ECAP module operates in APWM mode This mode forces the following configuration: 1- Inhibits TSCNT resets via PRD_eq event 2- Inhibits Shadow loads on CAP1 &#38; 2 registers 3- Permits User to enable CAP1-4 register load 4- CAPx/APWMx pin operates as a Capture input*; 1'b1 ECAP module operates in APWM mode This mode forces the following configuration: 1- Resets TSCNT on PRD_eq event (period boundary) 2- Permits Shadow loading on CAP1 &#38; 2 registers 3- Disables loading of Time-stamps into CAP1-4 regs 4- CAPx/APWMx pin operates as a APWM output*" range="25" rwaccess="R/W"/> 
		<bitfield id="SWSYNC" width="1" begin="24" end="24" resetval="0x0" description="Software forced Counter (TSCNT) sync'ing: 1'b0 Writing a Zero has no effect Reading will always return a zero; 1'b1 Writing a One will force a TSCNT shadow load of current ECAP module and any ECAP modules down-stream providing the SYNCO_SEL bits are 2'b00. After writing a one this bit returns to a zero.  Note: This provides a convenient S/W method to synchronize some or all ECAP Timebases. In APWM mode the sync'ing can also be done via the PRD_eq event." range="24" rwaccess="WTC"/> 
		<bitfield id="SYNCO_SEL" width="2" begin="23" end="22" resetval="0x0" description="Sync-Out select: 2'b00 Select Sync-In event to be the Sync-Out signal (pass through); 2'b01 Select PRD_eq event to be the Sync-Out signal; 2'b10 DISABLE Sync Out Signal; 2'b11 DISABLE Sync Out Signal; Note: Selection PRD_eq is meaningful only in APWM mode, however can still be chosen in CAP mode if user believes it to be useful." range="23 - 22" rwaccess="R/W"/> 
		<bitfield id="SYNCI_EN" width="1" begin="21" end="21" resetval="0x0" description="Counter (TSCNT) Sync-In select mode: 1'b0 Disable Sync-In option 1'b1 Enable Counter (TSCNT) to be loaded from CNTPHS register upon either a SYNCI signal or a S/W force event." range="21" rwaccess="R/W"/> 
		<bitfield id="TSCNTSTP" width="1" begin="20" end="20" resetval="0x0" description="Counter Stop (freeze) Control: 1'b0 Counter Stopped; 1'b1 Counter Free Running" range="20" rwaccess="R/W"/> 
		<bitfield id="REARM_RESET" width="1" begin="19" end="19" resetval="0x0" description="One-Shot Re-arming, i.e. Wait for stop Trigger: Writing a One Arms the One-Shot sequence, i.e.: 1. Resets the Mod4 counter to zero 2. Un-freezes the Mod4 counter 3. Enables Capture Register Loads; Writing a zero has no effect.  Reading always returns a 0.  Note: The RE-ARM function is valid in ONESHT or CONTINOUS mode." range="19" rwaccess="WTC"/> 
		<bitfield id="STOPVALUE" width="2" begin="18" end="17" resetval="0x3" description="Stop value for One-Shot mode: This is the number (between 1-4) of Captures allowed to occur before the CAP(1-4) registers are frozen, i.e.Capture sequence is stopped.  2'b00 Stop after Capture Event 1; 2'b01 Stop after Capture Event 2; 2'b10 Stop after Capture Event 3; 2'b11 Stop after Capture Event 4; Notes: [1] STOPVALUE is compared to Mod4 counter, when equal, 2 actions occur: 1- Mod4 Counter is stopped (frozen) 2- Capture Register Loads are inhibited [2] In one shot mode, further interrupt events are blocked until we re-arm, once the number of events captured has been reached." range="18 - 17" rwaccess="R/W"/> 
		<bitfield id="CONT_ONESHT" width="1" begin="16" end="16" resetval="0x0" description="Continuous or Oneshot mode control: (applicable only in Capture mode) 1'b0 Operate in Continuous mode 1'b1 Operate in One-Shot mode" range="16" rwaccess="R/W"/> 
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation Control 2'b00 TSCNT Counter stops immediately on emulation suspend; 2'b01 TSCNT Counter runs until = 0; 2'b1X TSCNT Counter is unaffected by emulation suspend (Run Free)" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="EVTFLTPS" width="5" begin="13" end="9" resetval="0x0" description="Event Filter prescale select: 5'b00000 divide by 1 (i.e. no prescale, by-pass the prescaler); 5'b00001 divide by 2; 5'b00010 divide by 4; 5'b00011 divide by 6; 5'b00100 divide by 8; 5'b00101 divide by 10; . . . . .; 5'b11110 divide by 60; 5'b11111 divide by 62" range="13 - 9" rwaccess="R/W"/> 
		<bitfield id="CAPLDEN" width="1" begin="8" end="8" resetval="0x0" description="Enable Loading of CAP1-4 registers on a Capture Event: 1'b0 Disable CAP1-4 register loads at capture Event time; 1'b1 Enable CAP1-4 register loads at capture Event time" range="8" rwaccess="R/W"/> 
		<bitfield id="CTRRST4" width="1" begin="7" end="7" resetval="0x0" description="Counter Reset on Capture Event 4: 1'b0 Do Not reset Counter on Capture Event 4 (absolute time stamp); 1'b1 Reset Counter after Event 4 time-stamp has been captured (used in Difference mode operation)" range="7" rwaccess="R/W"/> 
		<bitfield id="CAP4POL" width="1" begin="6" end="6" resetval="0x0" description="Capture Event 4 Polarity select: 1'b0 Capture event 4 triggered on a Rising Edge (FE); 1'b1 Capture event 4 triggered on a Falling Edge (FE)" range="6" rwaccess="R/W"/> 
		<bitfield id="CTRRST3" width="1" begin="5" end="5" resetval="0x0" description="Counter Reset on Capture Event 3: 1'b0 Do Not reset Counter on Capture Event 3 (absolute time stamp); 1'b1 Reset Counter after Event 3 time-stamp has been captured (used in Difference mode operation)" range="5" rwaccess="R/W"/> 
		<bitfield id="CAP3POL" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 3 Polarity select: 1'b0 Capture event 3 triggered on a Rising Edge (FE); 1'b1 Capture event 3 triggered on a Falling Edge (FE)" range="4" rwaccess="R/W"/> 
		<bitfield id="CTRRST2" width="1" begin="3" end="3" resetval="0x0" description="Counter Reset on Capture Event 2: 1'b0 Do Not reset Counter on Capture Event 2 (absolute time stamp); 1'b1 Reset Counter after Event 2 time-stamp has been captured (used in Difference mode operation)" range="3" rwaccess="R/W"/> 
		<bitfield id="CAP2POL" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Polarity select: 1'b0 Capture event 2 triggered on a Rising Edge (FE); 1'b1 Capture event 2 triggered on a Falling Edge (FE)" range="2" rwaccess="R/W"/> 
		<bitfield id="CTRRST1" width="1" begin="1" end="1" resetval="0x0" description="Counter Reset on Capture Event 1: 1'b0 Do Not reset Counter on Capture Event 1 (absolute time stamp); 1'b1 Reset Counter after Event 1 time-stamp has been captured (used in Difference mode operation)" range="1" rwaccess="R/W"/> 
		<bitfield id="CAP1POL" width="1" begin="0" end="0" resetval="0x0" description="Capture Event 1 Polarity select: 1'b0 Capture event 1 triggered on a Rising Edge (FE); 1'b1 Capture event 1 triggered on a Falling Edge (FE)" range="0" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_ECINT_EN_FLG" acronym="CTL_STS_ECINT_EN_FLG" offset="0x2C" width="32" description="">
		<bitfield id="CMPEQ_FLG" width="1" begin="23" end="23" resetval="0x0" description="Compare Equal Status Flag: Reading a 1 on this bit indicates the Counter (TSCNT) reached the Compare register value (ACMP) Reading a 0 indicates no event occurred Note: This flag is only active in APWM mode." range="23" rwaccess="R"/> 
		<bitfield id="PRDEQ_FLG" width="1" begin="22" end="22" resetval="0x0" description="Period Equal Status Flag: Reading a 1 on this bit indicates the Counter (TSCNT) reached the Period register value (APER) and was reset.  Reading a 0 indicates no event occurred Notes: This flag is only active in APWM mode." range="22" rwaccess="R"/> 
		<bitfield id="CNTOVF_FLG" width="1" begin="21" end="21" resetval="0x0" description="Counter Overflow Status Flag: Reading a 1 on this bit indicates the Counter (TSCNT) has made the transition from 0xFFFFFFFF  0x00000000 Reading a 0 indicates no event occurred.  Note: This flag is active in CAP &#38; APWM mode." range="21" rwaccess="R"/> 
		<bitfield id="CEVT4_FLG" width="1" begin="20" end="20" resetval="0x0" description="Capture Event 4 Status Flag: Reading a 1 on this bit indicates the fourth event occurred at ECAPx pin.  Reading a 0 indicates no event occurred. Note: This flag is only active in CAP mode." range="20" rwaccess="R"/> 
		<bitfield id="CEVT3_FLG" width="1" begin="19" end="19" resetval="0x0" description="Capture Event 3 Status Flag: Reading a 1 on this bit indicates the third event occurred at ECAPx pin.  Reading a 0 indicates no event occurred. Note: This flag is only active in CAP mode." range="19" rwaccess="R"/> 
		<bitfield id="CEVT2_FLG" width="1" begin="18" end="18" resetval="0x0" description="Capture Event 2 Status Flag: Reading a 1 on this bit indicates the second event occurred at ECAPx pin.  Reading a 0 indicates no event occurred. Note: This flag is only active in CAP mode." range="18" rwaccess="R"/> 
		<bitfield id="CEVT1_FLG" width="1" begin="17" end="17" resetval="0x0" description="Capture Event 1 Status Flag: Reading a 1 on this bit indicates the first event occurred at ECAPx pin.  Reading a 0 indicates no event occurred. Note: This flag is only active in CAP mode." range="17" rwaccess="R"/> 
		<bitfield id="INT_FLG" width="1" begin="16" end="16" resetval="0x0" description="Global Interrupt Status Flag: Reading a 1 on this bit indicates that an interrupt was generated from one of the following events.  Reading a 0 indicates no interrupt generated." range="16" rwaccess="R"/> 
		<bitfield id="CMPEQ_EN" width="1" begin="7" end="7" resetval="0x0" description="Compare Equal Interrupt Enable: 1'b0 Disabled Compare Equal as an Interrupt source; 1'b1 Enable Compare Equal as an Interrupt source" range="7" rwaccess="R/W"/> 
		<bitfield id="PRDEQ_EN" width="1" begin="6" end="6" resetval="0x0" description="Period Equal Interrupt Enable: 1'b0 Disabled Period Equal as an Interrupt source; 1'b1 Enable Period Equal as an Interrupt source" range="6" rwaccess="R/W"/> 
		<bitfield id="CNTOVF_EN" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Interrupt Enable: 1'b0 Disabled Counter Overflow as an Interrupt source; 1'b1 Enable Counter Overflow as an Interrupt source" range="5" rwaccess="R/W"/> 
		<bitfield id="CEVT4_EN" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Interrupt Enable: 1'b0 Disabled Capture Event 4 as an Interrupt source: 1'b1 Enable Capture Event 4 as an Interrupt source" range="4" rwaccess="R/W"/> 
		<bitfield id="CEVT3_EN" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Interrupt Enable: 1'b0 Disabled Capture Event 3 as an Interrupt source: 1'b1 Enable Capture Event 3 as an Interrupt source" range="3" rwaccess="R/W"/> 
		<bitfield id="CEVT2_EN" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Interrupt Enable: 1'b0 Disabled Capture Event 2 as an Interrupt source: 1'b1 Enable Capture Event 2 as an Interrupt source" range="2" rwaccess="R/W"/> 
		<bitfield id="CEVT1_EN" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Interrupt Enable: 1'b0 Disabled Capture Event 1 as an Interrupt source: 1'b1 Enable Capture Event 1 as an Interrupt source" range="1" rwaccess="R/W"/>
	</register>
	<register id="CTL_STS_ECINT_CLR_FRC" acronym="CTL_STS_ECINT_CLR_FRC" offset="0x30" width="32" description="">
		<bitfield id="CMPEQ_FRC" width="1" begin="23" end="23" resetval="0x0" description="Force Compare Equal: Writing a 1 to this bit will set the CMPEQ flag bit.  Writing of 0 will be ignored.  Always reads back a 0." range="23" rwaccess="W1TS"/> 
		<bitfield id="PRDEQ_FRC" width="1" begin="22" end="22" resetval="0x0" description="Force Period Equal: Writing a 1 to this bit will set the PRDEQ flag bit.  Writing of 0 will be ignored.  Always reads back a 0." range="22" rwaccess="W1TS"/> 
		<bitfield id="CNTOVF_FRC" width="1" begin="21" end="21" resetval="0x0" description="Force Counter Overflow: Writing a 1 to this bit will set the CNTOVF flag bit.  Writing of 0 will be ignored.  Always reads back a 0." range="21" rwaccess="W1TS"/> 
		<bitfield id="CEVT4_FRC" width="1" begin="20" end="20" resetval="0x0" description="Force Capture Event 4: Writing a 1 to this bit will set the CEVT4 flag bit.  Writing of 0 will be ignored.  Always reads back a 0." range="20" rwaccess="W1TS"/> 
		<bitfield id="CEVT3_FRC" width="1" begin="19" end="19" resetval="0x0" description="Force Capture Event 3: Writing a 1 to this bit will set the CEVT3 flag bit.  Writing of 0 will be ignored.  Always reads back a 0." range="19" rwaccess="W1TS"/> 
		<bitfield id="CEVT2_FRC" width="1" begin="18" end="18" resetval="0x0" description="Force Capture Event 2: Writing a 1 to this bit will set the CEVT2 flag bit.  Writing of 0 will be ignored.  Always reads back a 0." range="18" rwaccess="W1TS"/> 
		<bitfield id="CEVT1_FRC" width="1" begin="17" end="17" resetval="0x0" description="Force Capture Event 1: Writing a 1 to this bit will set the CEVT1 flag bit.  Writing of 0 will be ignored.  Always reads back a 0." range="17" rwaccess="W1TS"/> 
		<bitfield id="CMPEQ_CLR" width="1" begin="7" end="7" resetval="0x0" description="Compare Equal Status Flag: Writing a 1 will clear the CMPEQ flag condition.  Writing a 0 will have no effect.  Always reads back a 0." range="7" rwaccess="W1TC"/> 
		<bitfield id="PRDEQ_CLR" width="1" begin="6" end="6" resetval="0x0" description="Period Equal Status Flag: Writing a 1 will clear the PRDEQ flag condition.  Writing a 0 will have no effect.  Always reads back a 0." range="6" rwaccess="W1TC"/> 
		<bitfield id="CNTOVF_CLR" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Status Flag: Writing a 1 will clear the CNTOVF flag condition.  Writing a 0 will have no effect.  Always reads back a 0." range="5" rwaccess="W1TC"/> 
		<bitfield id="CEVT4_CLR" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Status Flag: Writing a 1 will clear the CEVT4 flag condition.  Writing a 0 will have no effect.  Always reads back a 0." range="4" rwaccess="W1TC"/> 
		<bitfield id="CEVT3_CLR" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Status Flag: Writing a 1 will clear the CEVT3 flag condition.  Writing a 0 will have no effect.  Always reads back a 0." range="3" rwaccess="W1TC"/> 
		<bitfield id="CEVT2_CLR" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Status Flag: Writing a 1 will clear the CEVT2 flag condition.  Writing a 0 will have no effect.  Always reads back a 0." range="2" rwaccess="W1TC"/> 
		<bitfield id="CEVT1_CLR" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Status Flag: Writing a 1 will clear the CEVT1 flag condition.  Writing a 0 will have no effect.  Always reads back a 0." range="1" rwaccess="W1TC"/> 
		<bitfield id="INT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Clear Flag: Writing a 1 will clear the INT flag and enable further interrupts to be generated if any of the event flags are set to 1.  Writing a 0 will have no effect.  Always reads back a 0." range="0" rwaccess="W1TC"/>
	</register>
	<register id="CTL_STS_PID" acronym="CTL_STS_PID" offset="0x5C" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="" range="31 - 30" rwaccess="R"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNCTION" width="12" begin="27" end="16" resetval="0x1234" description="" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x8" description="" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="" range="5 - 0" rwaccess="R"/>
	</register>
</module>